import 'package:flutter/material.dart';

import '../schema/notification_schema.dart';



class NotificationProvider with ChangeNotifier {

  late final  List<NotificationType> _notification = [
    NotificationType(title: "মেডিকেল পরিক্ষা রেসাল্ট", date: DateTime(2023, 6, 25), description:"আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। ", ),
    NotificationType(title: "ঢাকা বিশ্ববিদ্যালয় ভর্তি ফর্ম", date: DateTime(2023, 6, 25), description:"আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। ", ),
    NotificationType(title: "বুয়েট পরিক্ষা যোগ্যতা", date: DateTime(2023, 6, 25), description:"আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। ", ),
    NotificationType(title: "মেডিকেল পরিক্ষা রেসাল্ট", date: DateTime(2023, 6, 25), description:"আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। ", ),
    NotificationType(title: "ঢাকা বিশ্ববিদ্যালয় ভর্তি ফর্ম", date: DateTime(2023, 6, 25), description:"আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। ", ),
    NotificationType(title: "বুয়েট পরিক্ষা যোগ্যতা", date: DateTime(2023, 6, 25), description:"আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। ", ),
    NotificationType(title: "মেডিকেল পরিক্ষা রেসাল্ট", date: DateTime(2023, 6, 25), description:"আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। আগামী ৩০ জুন মেডিকেল পরিক্ষার ফলাফল প্রকাশ করা  হবে। ", ),
  ];
  late  int _response;
  late int filterYear = DateTime.now().year;
  final bool _isLoading = false;


  List<NotificationType> get items {
    return [..._notification];
  }

  bool get isLoading{
    return _isLoading;
  }
}